ELPasEDT/src/Documents/ОперативныйЖурнал/ОперативныйЖурнал.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ОперативныйЖурнал</name>
  <comment>(ПОГ и ЭЖ)</comment>
  <basedOn>Document.ОперативныйЖурнал</basedOn>
  <registerRecords>InformationRegister.СобытияОперативногоЖурнала</registerRecords>
  <registerRecords>InformationRegister.СостояниеОборудования</registerRecords>
  <registerRecords>InformationRegister.АктивныеСмены</registerRecords>
  <registerRecords>InformationRegister.ОборудованиеНаКонтроле</registerRecords>
  <attributes>
    <name>ВидЗаписи</name>
    <type>
      <types>CatalogRef.ВидыЗаписей</types>
    </type>
  </attributes>
  <attributes>
    <name>Событие</name>
    <type>
      <types>CatalogRef.События</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗамечанияИРаспоряжения</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗонаОтветственности</name>
    <type>
      <types>CatalogRef.ЗоныОтветственности</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыДокументаОперативногоЖурнала</types>
    </type>
  </attributes>
  <attributes>
    <name>Смена</name>
    <type>
      <types>CatalogRef.Смены</types>
    </type>
  </attributes>
  <attributes>
    <name>Контролер</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>СменаЗакрыта</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументЗакрытия</name>
    <type>
      <types>DocumentRef.ОперативныйЖурнал</types>
    </type>
  </attributes>
  <attributes>
    <name>СозданАвтоматически</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСобытия</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Вахта</name>
    <type>
      <types>CatalogRef.Вахты</types>
    </type>
  </attributes>
  <attributes>
    <name>СтаршийСмены</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаСмены</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияСмены</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>СтрокаОборудования</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПолученоОт</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Распоряжение</name>
    <type>
      <types>DocumentRef.ОперативныйЖурнал</types>
    </type>
  </attributes>
  <attributes>
    <name>СменаПрописью</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтрокаОборудованияДиспетчерское</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусОтданногоРаспоряжения</name>
    <type>
      <types>EnumRef.СтатусыОтданныхРаспоряжений</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоПерваяЗапись</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Чистовик</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоОтвет</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Завершено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Оповещение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодписанЭП</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>мШаблон</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Оборудование</name>
    <attributes>
      <name>Оборудование</name>
      <type>
        <types>CatalogRef.Оборудование</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтатусОборудования</name>
      <type>
        <types>EnumRef.СтатусыОборудования</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатусАктуален</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаВыходаИзСтроя</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончанияРемонтныхРабот</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КонтрольВыполнен</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>СодержаниеЗаписи</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДиспетчерскоеНаименование</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СостояниеОборудования</name>
      <type>
        <types>EnumRef.СостоянияОборудованияОЖ</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Сотрудники</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>Должность</name>
      <type>
        <types>CatalogRef.Должности</types>
      </type>
    </attributes>
    <attributes>
      <name>Подразделение</name>
      <type>
        <types>CatalogRef.Подразделения</types>
      </type>
    </attributes>
    <attributes>
      <name>ВремяНачалаРаботы</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВремяОкончанияРаботы</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Выбран</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаКонтроляЗнаний</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПараметрыИРежимы</name>
    <attributes>
      <name>Параметр</name>
      <type>
        <types>CatalogRef.ПараметрыИРежимы</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СоставСмены</name>
    <attributes>
      <name>ФизическоеЛицо</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЧекЛист</name>
    <attributes>
      <name>Показатель</name>
      <type>
        <types>CatalogRef.УдалитьПоказателиЧекЛиста</types>
        <types>CatalogRef.ПоказателиЧекЛиста</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДокументыДляОзнакомления</name>
    <attributes>
      <name>Документ</name>
      <type>
        <types>CatalogRef.Журналы</types>
      </type>
    </attributes>
    <attributes>
      <name>КОзнакомлениюПринимающему</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ELPasEDT/src/Catalogs/ВидыЗаписей/ВидыЗаписей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВидыЗаписей</name>
  <comment>(ПОГ и ЭЖ)</comment>
  <predefined>
    <items>
      <name>Авария</name>
      <description>Авария</description>
    </items>
    <items>
      <name>Включение</name>
      <description>Включение</description>
    </items>
    <items>
      <name>ДополнениеВСоставСмены</name>
      <description>Дополнение в состав смены</description>
    </items>
    <items>
      <name>ИзменениеРежимаРаботыОборудования</name>
      <description>Изменение режима работы оборудования</description>
    </items>
    <items>
      <name>КонтрольВнешний</name>
      <description>Контроль внешний</description>
    </items>
    <items>
      <name>КонтрольЖурнала</name>
      <description>Контроль журнала</description>
    </items>
    <items>
      <name>КонтрольОборудования</name>
      <description>Контроль оборудования</description>
    </items>
    <items>
      <name>Неисправность</name>
      <description>Неисправность</description>
    </items>
    <items>
      <name>Обращение</name>
      <description>Обращение</description>
    </items>
    <items>
      <name>ОперативныеПереговоры</name>
      <description>Оперативные переговоры</description>
    </items>
    <items>
      <name>ОтклонениеПараметров</name>
      <description>Отклонение параметров</description>
    </items>
    <items>
      <name>Отключение</name>
      <description>Отключение</description>
    </items>
    <items>
      <name>ПередачаСмены</name>
      <description>Передача смены</description>
    </items>
    <items>
      <name>Прочее</name>
      <description>Прочее</description>
    </items>
    <items>
      <name>РаспоряжениеНСС</name>
      <description>Распоряжение НСС</description>
    </items>
    <items>
      <name>РемонтОборудования</name>
      <description>Ремонт оборудования</description>
    </items>
  </predefined>
  <attributes>
    <name>ЗаполнятьТЧСотрудников</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаполнятьТЧОборудования</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьСобытиеПоУмолчанию</name>
    <type>
      <types>CatalogRef.События</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодписыватьЭЦП</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьОрганизация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>УдалитьСобытия</name>
    <attributes>
      <name>Событие</name>
      <type>
        <types>CatalogRef.События</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ELPasEDT/src/Catalogs/События/События.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>События</name>
  <comment>(ПОГ и ЭЖ)</comment>
  <predefined>
    <items>
      <name>НачатьРаботы</name>
      <description>Начать работы (авария)</description>
    </items>
    <items>
      <name>ОбращениеВыполнено</name>
      <description>Обращение выполнено</description>
    </items>
    <items>
      <name>ОбращениеНеВыполнено</name>
      <description>Обращение не выполнено</description>
    </items>
    <items>
      <name>ОтданоРаспоряжение</name>
      <description>Отдано распоряжение</description>
    </items>
    <items>
      <name>ПолученоОбращение</name>
      <description>Получено обращение</description>
    </items>
    <items>
      <name>ПолученоРаспоряжение</name>
      <description>Получено распоряжение</description>
    </items>
    <items>
      <name>ПринятоОбращение</name>
      <description>Принято обращение</description>
    </items>
    <items>
      <name>ПринятоРаспоряжение</name>
      <description>Принято распоряжение</description>
    </items>
    <items>
      <name>Прочее</name>
      <description>Прочее</description>
    </items>
    <items>
      <name>РаспоряжениеВыполнено</name>
      <description>Распоряжение выполнено</description>
    </items>
    <items>
      <name>РаспоряжениеНеВыполнено</name>
      <description>Распоряжение не выполнено</description>
    </items>
    <items>
      <name>СменуПринял</name>
      <description>Смену принял</description>
    </items>
    <items>
      <name>СменуСдал</name>
      <description>Смену сдал</description>
    </items>
    <items>
      <name>СформированоОбращение</name>
      <description>Сформировано обращение</description>
    </items>
  </predefined>
  <attributes>
    <name>ОповещениеНСС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СобытиеВЖурналеНСС</name>
    <type>
      <types>CatalogRef.События</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьОрганизация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыЗаявокСокращенный</types>
    </type>
  </attributes>
  <attributes>
    <name>СсылкаДляИзменения</name>
    <type>
      <types>CatalogRef.События</types>
    </type>
  </attributes>
</mdclass:Catalog>

ELPasEDT/src/Documents/ОперативныйЖурнал/ManagerModule.bsl
#Область ПрограммныйИнтерфейс

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	// Карточка записи
    КомандаПечати = КомандыПечати.Добавить();
    КомандаПечати.МенеджерПечати = "Документ.ОперативныйЖурнал";
    КомандаПечати.Идентификатор = "КарточкаЗаписи";
    КомандаПечати.Представление = НСтр("ru = 'Карточка записи'");
    КомандаПечати.ПроверкаПроведенияПередПечатью = Истина; 
	
КонецПроцедуры

#КонецОбласти

// Формирует печатные формы.
//
// Параметры:
//  МассивОбъектов - Массив - ссылки на объекты, которые нужно распечатать;
//  ПараметрыПечати - Структура - дополнительные настройки печати;
//  КоллекцияПечатныхФорм - ТаблицаЗначений - сформированные табличные документы (выходной параметр)
//  ОбъектыПечати - СписокЗначений - значение - ссылка на объект;
//                                            представление - имя области, в которой был выведен объект (выходной параметр);
//  ПараметрыВывода - Структура - дополнительные параметры сформированных табличных документов (выходной параметр).
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	НужноПечататьМакет = УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "КарточкаЗаписи");
    Если НужноПечататьМакет Тогда
        УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
        КоллекцияПечатныхФорм,
        "КарточкаЗаписи",
        НСтр("ru = 'Карточка записи'"),
        ПечатьКарточкиЗаписи(МассивОбъектов, ОбъектыПечати),
        ,
        "Документ.ОперативныйЖурнал.ПФ_MXL_КарточкаЗаписи");
    КонецЕсли;
	
КонецПроцедуры

Функция ПечатьКарточкиЗаписи(МассивОбъектов, ОбъектыПечати) Экспорт
	
	
	//Жолткевич
	ТабДок = Новый ТабличныйДокумент;
	
	Макет = Документы.ОперативныйЖурнал.ПолучитьМакет("ПечатьЗакрытиеСмены");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ОперативныйЖурнал.Вахта КАК Вахта,
	|	ОперативныйЖурнал.ВидЗаписи КАК ВидЗаписи,
	|	ОперативныйЖурнал.Дата КАК Дата,
	|	ОперативныйЖурнал.ДатаНачалаСмены КАК ДатаНачалаСмены,
	|	ОперативныйЖурнал.ДатаОкончанияСмены КАК ДатаОкончанияСмены,
	|	ОперативныйЖурнал.ДатаСобытия КАК ДатаСобытия,
	|	ОперативныйЖурнал.ДокументЗакрытия КАК ДокументЗакрытия,
	|	ОперативныйЖурнал.Завершено КАК Завершено,
	|	ОперативныйЖурнал.ЗамечанияИРаспоряжения КАК ЗамечанияИРаспоряжения,
	|	ОперативныйЖурнал.ЗонаОтветственности КАК ЗонаОтветственности,
	|	ОперативныйЖурнал.Комментарий КАК Комментарий,
	|	ОперативныйЖурнал.Контролер КАК Контролер,
	|	ОперативныйЖурнал.Номер КАК Номер,
	|	ОперативныйЖурнал.Описание КАК Описание,
	|	ОперативныйЖурнал.Оповещение КАК Оповещение,
	|	ОперативныйЖурнал.Ответственный КАК Ответственный,
	|	ОперативныйЖурнал.Подразделение КАК Подразделение,
	|	ОперативныйЖурнал.ПолученоОт КАК ПолученоОт,
	|	ОперативныйЖурнал.Распоряжение КАК Распоряжение,
	|	ОперативныйЖурнал.Смена КАК Смена,
	|	ОперативныйЖурнал.СменаЗакрыта КАК СменаЗакрыта,
	|	ОперативныйЖурнал.СменаПрописью КАК СменаПрописью,
	|	ОперативныйЖурнал.Событие КАК Событие,
	|	ОперативныйЖурнал.СозданАвтоматически КАК СозданАвтоматически,
	|	ОперативныйЖурнал.СтаршийСмены КАК СтаршийСмены,
	|	ОперативныйЖурнал.Статус КАК Статус,
	|	ОперативныйЖурнал.СтатусОтданногоРаспоряжения КАК СтатусОтданногоРаспоряжения,
	|	ОперативныйЖурнал.СтрокаОборудования КАК СтрокаОборудования,
	|	ОперативныйЖурнал.СтрокаОборудованияДиспетчерское КАК СтрокаОборудованияДиспетчерское,
	|	ОперативныйЖурнал.Чистовик КАК Чистовик,
	|	ОперативныйЖурнал.ЭтоОтвет КАК ЭтоОтвет,
	|	ОперативныйЖурнал.ЭтоПерваяЗапись КАК ЭтоПерваяЗапись,
	|	ОперативныйЖурнал.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ОперативныйЖурнал КАК ОперативныйЖурнал
	|ГДЕ
	|	ОперативныйЖурнал.Ссылка В(&Ссылка)";
	
	Запрос.Параметры.Вставить("Ссылка", МассивОбъектов[0]);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	МассивВыводимыхОбластей = Новый Массив;
	
	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		
		СтрокаНСС = ?(Выборка.Ответственный.ФизическоеЛицо.НСС, "НСС ",?(Выборка.Ответственный.ФизическоеЛицо.НСЦ, "НСЦ ","") );
		ОбластьЗаголовок.Параметры.СменаЗаголовок =	 Строка(Формат(Выборка.Дата,"ДЛФ=Д"))+"  Подразделение:"+ Строка(Выборка.Подразделение)+"  Смена: "
													+ Строка(Выборка.Смена)+" ("+ Формат(Выборка.Смена.ВремяНачала,"ДЛФ=T")+"-"
													+Формат(Выборка.Смена.ВремяОкончания,"ДЛФ=T")+")  Ответственный:"+ СтрокаНСС + Строка(Выборка.Ответственный);
		НомерСтраницы=1;	
 		ОбластьЗаголовок.Параметры.ТекстНомерСтраницы = "Страница № " + Строка(НомерСтраницы);
		
		ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
		ТабДок.АвтоМасштаб 	= Истина;	
		ТабДок.ПолеСлева		= 10;
		ТабДок.ПолеСправа	= 10;
		Масштаб=120;

		ТабДок.Вывести(ОбластьЗаголовок);
		
		СоставЗаголовок= Макет.ПолучитьОбласть("СоставЗаголовок");
		ТабДок.Вывести(СоставЗаголовок);
		СоставШапка= Макет.ПолучитьОбласть("СоставШапка");
		ТабДок.Вывести(СоставШапка);
		
		Состав= Макет.ПолучитьОбласть("Состав");
		Номер=1;
		Для Каждого Строка Из Выборка.Ссылка.Сотрудники  Цикл          // Формат(ИмяРеквизита,"ДЛФ=Д")
			Если Строка.Выбран тогда
				Состав.Параметры.Номер = Номер;
				Состав.Параметры.Сотрудник = Строка.Сотрудник;
				Состав.Параметры.Должность = Строка.Должность;
				Состав.Параметры.Подразделение = Строка.Подразделение;
				Состав.Параметры.ДатаПроверки = Формат(Строка.ДатаКонтроляЗнаний,"ДЛФ=Д");
				Состав.Параметры.НачалоРаботы = Формат(Строка.ВремяНачалаРаботы,"ДЛФ=T"); 
				Состав.Параметры.ОкончаниеРаботы = Формат(Строка.ВремяОкончанияРаботы,"ДЛФ=T");
				ТабДок.Вывести(Состав);
				Номер=Номер+1;
			КонецЕсли;	
		КонецЦикла;
		
		//чек лист
		ТЗпоказатели = "";
		ТЗчекЛист ="";
		
		ЗапросЧекЛист = Новый Запрос;
		ЗапросЧекЛист.Текст =
		"ВЫБРАТЬ
		|	ОперативныйЖурналЧекЛист.Показатель КАК Показатель,
		|	ОперативныйЖурналЧекЛист.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	ОперативныйЖурналЧекЛист.Значение КАК ЗначениеПрием,
		|	НЕОПРЕДЕЛЕНО КАК ЗначениеСдача
		|ИЗ
		|	Документ.ОперативныйЖурнал.ЧекЛист КАК ОперативныйЖурналЧекЛист
		|ГДЕ
		|	ОперативныйЖурналЧекЛист.Ссылка.Смена = &Смена
		|	И ОперативныйЖурналЧекЛист.Ссылка.Вахта = &Вахта
		|	И ОперативныйЖурналЧекЛист.Ссылка.Подразделение = &Подразделение
		|	И ОперативныйЖурналЧекЛист.Ссылка.Дата МЕЖДУ &Дата1 И &Дата2
		|	И ОперативныйЖурналЧекЛист.Ссылка.ВидЗаписи = &ВидЗаписи
		|	И ОперативныйЖурналЧекЛист.Ссылка.Чистовик = ИСТИНА
		|	И ОперативныйЖурналЧекЛист.Ссылка.Событие = &Событие";
		
		ЗапросЧекЛист.Параметры.Вставить("Вахта", Выборка.Вахта);
		ЗапросЧекЛист.Параметры.Вставить("Смена", Выборка.Смена);
		ЗапросЧекЛист.Параметры.Вставить("Подразделение", Выборка.Подразделение);
		ЗапросЧекЛист.Параметры.Вставить("Дата1", Выборка.Дата-46800);  //документы за 13 часов
		ЗапросЧекЛист.Параметры.Вставить("Дата2", Выборка.Дата+3600);   //еще доп час
		ЗапросЧекЛист.Параметры.Вставить("ВидЗаписи", Справочники.ВидыЗаписей.ПередачаСмены);
		ЗапросЧекЛист.Параметры.Вставить("Событие", Справочники.События.СменуПринял);

	 	ТЗчекЛист = ЗапросЧекЛист.Выполнить().Выгрузить();

		Для Каждого СтрокаЧеклист Из Выборка.Ссылка.ЧекЛист  Цикл
			
			Строка = ТЗчекЛист.Добавить();
			Строка.Показатель = СтрокаЧекЛист.Показатель;
			Строка.ЕдиницаИзмерения = СтрокаЧекЛист.ЕдиницаИзмерения;
			Строка.ЗначениеСдача = СтрокаЧекЛист.Значение;
			Строка.ЗначениеПрием = Неопределено;

		КонецЦикла;
		
		ТЗпоказатели = ТЗчекЛист.Скопировать(,"Показатель,ЕдиницаИзмерения");
		ТЗпоказатели.Свернуть("Показатель,ЕдиницаИзмерения");

		//ТЗчекЛист.Свернуть("Показатель,ЕдиницаИзмерения","ЗначениеПрием,ЗначениеСдача");
		
		ЧеклистЗаголовок= Макет.ПолучитьОбласть("ЧеклистЗаголовок");
		ТабДок.Вывести(ЧеклистЗаголовок);
		ЧеклистШапка= Макет.ПолучитьОбласть("ЧеклистШапка");
		ТабДок.Вывести(ЧеклистШапка);

		ЧекЛист= Макет.ПолучитьОбласть("ЧекЛист");
        Номер=1;

		Для Каждого Строка Из ТЗпоказатели  Цикл
	
			ЧекЛист.Параметры.Номер = Номер;
			ЧекЛист.Параметры.Показатель = Строка.Показатель;
			ЧекЛист.Параметры.ЕдиницаИзмерения = Строка.ЕдиницаИзмерения;
			ЧекЛист.Параметры.ЗначениеПрием = "";
			ЧекЛист.Параметры.ЗначениеСдача = "";
			Для Каждого СтрокаЧеклист Из ТЗчекЛист Цикл
				Если СтрокаЧеклист.Показатель = Строка.Показатель и СтрокаЧеклист.ЕдиницаИзмерения = Строка.ЕдиницаИзмерения тогда
					Если СтрокаЧеклист.ЗначениеПрием <> null и СтрокаЧеклист.ЗначениеПрием <> Неопределено тогда
						ЧекЛист.Параметры.ЗначениеПрием = СтрокаЧеклист.ЗначениеПрием;
					КонецЕсли;
					Если СтрокаЧеклист.ЗначениеСдача <> null и СтрокаЧеклист.ЗначениеСдача <> Неопределено тогда
						ЧекЛист.Параметры.ЗначениеСдача = СтрокаЧеклист.ЗначениеСдача;
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
						
			ТабДок.Вывести(ЧекЛист);
			Номер=Номер+1;
		КонецЦикла;
		
		// документы
		
		ДокументыЗаголовок= Макет.ПолучитьОбласть("ДокументыЗаголовок");
		ТабДок.Вывести(ДокументыЗаголовок);
		ДокументыШапка= Макет.ПолучитьОбласть("ДокументыШапка");
		ТабДок.Вывести(ДокументыШапка);

		ДокументыСтр = Макет.ПолучитьОбласть("Документы");
        Номер=1;
		Для Каждого Строка Из Выборка.Ссылка.ДокументыДляОзнакомления  Цикл
			ДокументыСтр.Параметры.Номер = Номер;
			ДокументыСтр.Параметры.Документ = Строка.Документ;
			ДокументыСтр.Параметры.Ознакомлен = ?(Строка.КОзнакомлениюПринимающему=истина,"Да","Нет");
			
			Если (Не ТабДок.ПроверитьВывод(ДокументыСтр)) Тогда
				НомерСтраницы    = НомерСтраницы + 1;
	            ОбластьЗаголовок.Параметры.ТекстНомерСтраницы = "Страница № " + Строка(НомерСтраницы);
				ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
	            ТабДок.Вывести(ОбластьЗаголовок);
	            ТабДок.Вывести(ДокументыШапка);
			КонецЕсли;
			
			ТабДок.Вывести(ДокументыСтр);
			Номер=Номер+1;
		КонецЦикла;

		
		// события 
		
		ЗапросСобытия = Новый Запрос;
		ЗапросСобытия.Текст =
		"ВЫБРАТЬ
		|	ОперативныйЖурнал.Дата КАК Дата,
		|	ОперативныйЖурнал.Комментарий КАК Комментарий,
		|	ОперативныйЖурнал.ВидЗаписи КАК ВидЗаписи,
		|	ОперативныйЖурнал.Событие КАК Событие,
		|	ОперативныйЖурнал.ДатаСобытия КАК ДатаСобытия
		|ИЗ
		|	Документ.ОперативныйЖурнал КАК ОперативныйЖурнал
		|ГДЕ
		|	ОперативныйЖурнал.Вахта = &Вахта
		|	И ОперативныйЖурнал.Дата МЕЖДУ &Дата1 И &Дата2
		|	И ОперативныйЖурнал.Подразделение = &Подразделение
		|	И ОперативныйЖурнал.Смена = &Смена
		|	И ОперативныйЖурнал.Проведен = ИСТИНА
		|	И ОперативныйЖурнал.Чистовик = ИСТИНА
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДатаСобытия";
		
		ЗапросСобытия.Параметры.Вставить("Вахта", Выборка.Вахта);
		ЗапросСобытия.Параметры.Вставить("Смена", Выборка.Смена);
		ЗапросСобытия.Параметры.Вставить("Подразделение", Выборка.Подразделение);
		ЗапросСобытия.Параметры.Вставить("Дата1", Выборка.Дата-46800);  //документы за 13 часов
		ЗапросСобытия.Параметры.Вставить("Дата2", Выборка.Дата+3600);   //еще доп час

	
		ВыборкаСобытия = ЗапросСобытия.Выполнить().Выбрать();

		ЗаписиШапка= Макет.ПолучитьОбласть("ЗаписиШапка");
		ТабДок.Вывести(ЗаписиШапка);
		
		Записи = Макет.ПолучитьОбласть("Записи");
		Пока ВыборкаСобытия.Следующий() Цикл
			Записи.Параметры.Время = ВыборкаСобытия.ДатаСобытия;
			Содержание=?(СокрЛП(ВыборкаСобытия.Комментарий)<>"",ВыборкаСобытия.Комментарий,Строка(ВыборкаСобытия.ВидЗаписи) +" ("+ Строка(ВыборкаСобытия.Событие)+")" );
			Записи.Параметры.Содержание = Содержание;
			
			Если (Не ТабДок.ПроверитьВывод(Записи)) Тогда
				НомерСтраницы    = НомерСтраницы + 1;
	            ОбластьЗаголовок.Параметры.ТекстНомерСтраницы = "Страница № " + Строка(НомерСтраницы);
				ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
	            ТабДок.Вывести(ОбластьЗаголовок);
	            ТабДок.Вывести(ЗаписиШапка);
			КонецЕсли;	
			ТабДок.Вывести(Записи);
			
			
		КонецЦикла;	
		
		//Если ВставлятьРазделительСтраниц Тогда
		//	ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		//КонецЕсли;
		
		//ВставлятьРазделительСтраниц = Истина;
		
	КонецЦикла;
	
    Возврат ТабДок;
	
	
КонецФункции
